IDEA StatiCa Open Model
ColumnDataEc2 Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ColumnDataEc2 type exposes the following members.
Properties
Name | Description
BracedY
 Braced structure Y-Y
BracedZ
 Braced structure Z-Z
CalculateY
 Gets an indication, whether imperfections and second order have to be performed perpendicular to the y axis.
 (Inherited from ColumnData.)
CalculateZ
 Gets an indication, whether imperfections and second order have to be performed perpendicular to the z axis.
 (Inherited from ColumnData.)
Calculation2ndOrderEffect
 Use calculation of 2nd order effect
EffectConsidered
 Effect considered
EffectiveLength
 Gets or sets type of input effective length
 (Inherited from ColumnData.)
FemL0Y
 effective length calculated in FEM for Y direction
 (Inherited from ColumnData.)
FemL0Z
 effective length calculated in FEM for Z direction
 (Inherited from ColumnData.)
FemLenghtFromFlexibleSupport
 true if FEM length were calculated from flexible supports
 (Inherited from ColumnData.)
GeometricImperfectionsSLS
 Use calculation geometric imperfections for SLS
GeometricImperfectionsULS
 Use calculation geometric imperfections for ULS
ImperfectionDirection
 Gets or sets the direction of imperfection.
 (Inherited from ColumnData.)
ImperfectionsInput
 Indicates, whether use user values or calculate effect of imperfections.
 (Inherited from ColumnData.)
L
 Gets or sets the system length of column.
 (Inherited from ColumnData.)
L0Y
 Gets or sets the user defined effective length of column for Y direction. If is not defined, the must be valid support data.
 (Inherited from ColumnData.)
L0Z
 Gets or sets the user defined effective length of column for Z direction.
 (Inherited from ColumnData.)
NumberOfVerticalMembersY
 Gets or sets the number of vertical member in Y direction.
NumberOfVerticalMembersZ
 Gets or sets the number of vertical member in Z direction.
SecondOrderEffectInput
 Indicates, whether use user values or calculate 2'nd order effect.
 (Inherited from ColumnData.)
SecondOrderEffectMethod
 Type of calculation method of 2nd order effect
SupportBottomY
 Gets or sets the end support. Not necessary if effective lengths are defined.
 (Inherited from ColumnData.)
SupportBottomZ
 Gets or sets the end support. Not necessary if effective lengths are defined.
 (Inherited from ColumnData.)
SupportTopY
 Gets or sets the end support. Not necessary if effective lengths are defined.
 (Inherited from ColumnData.)
SupportTopZ
 Gets or sets the end support. Not necessary if effective lengths are defined.
 (Inherited from ColumnData.)
TotalL
 Gets or sets the total length of building
UserValuec0Y
 c0 user value - for nominal stiffness
UserValuec0Z
 c0 user value - for nominal stiffness
UserValuecY
 c user value - for nominal stiffness
UserValuecZ
 c user value - for nominal stiffness
ValueTypeOfc0Y
 Type of c0 value
ValueTypeOfc0Z
 Type of c0 value
ValueTypeOfcY
 Type of c value - for nominal curvature
ValueTypeOfcZ
 Type of c value - for nominal curvature
Top
See Also
Reference
ColumnDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace